; Єдина конструкція deftemplate для опису маршруту (ребра мережі)
(deftemplate route
    (slot from) ; місто відправлення
    (slot to)   ; місто прибуття
)

; Факти, що описують мережу авіаліній на основі графа
(deffacts airline-network
    (route (from "Сан-Франциско") (to "Чикаго"))
    (route (from "Сан-Франциско") (to "Лос-Анджелес"))
    (route (from "Хьюстон") (to "Сан-Франциско"))
    (route (from "Лос-Анджелес") (to "Хьюстон"))
    (route (from "Чикаго") (to "Индианаполис"))
    (route (from "Индианаполис") (to "Хьюстон"))
    (route (from "Нью-Йорк") (to "Чикаго"))
    (route (from "Хьюстон") (to "Нью-Йорк"))
)